#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <string.h>
#include <unistd.h>
#include <time.h>
#include "aiwi.h"

#define MAX_PROMPT 301 //tamanho do prompt (300 caracteres)

//função que pede um "prompt" pro usuário, puro fingimento
void usr_input(char str[]){
    
    printf("User: ");               //indica que é pro usuário digitar
    fgets(str, MAX_PROMPT, stdin); //atribui com fgets
    str[strcspn(str, "\n")] = '\0'; //remove o '\n' e troca por '\0'
    setbuf(stdin, NULL);            //limpa o buffer

    printf("[DEBUG] Prompt: %s\n", str);
}

//função que sorteia um número aleatório para selecionar uma das respostas pré-definidas
void n_random_response(int *n, int *i, bool usr_free){

    if (*i >= 9 && usr_free) { //atingiu o limite de mensagens e o plano é gratuíto

        ia_premium_ad();
    } else { //não atingiu o limite de mensagens ou o plano é premium
        *n = (rand() % 16) + 1;
        
        //incrementa o contador de msgs se o usuário for do "plano free"
        if (usr_free) { 
            
            *i = *i + 1;
        }
    }
}

//função que limpa o terminal dependendo do sistema operacional
void clear_terminal(){

    #ifdef __linux__
        system("clear");

    #elif _WIN32
        system("cls");

    #endif
}

//função que imprime no terminal a resposta aleatória definida por "n_random_response(int *dado);"
void print_response(int dado_r){

    printf("IA: ");

    switch (dado_r) {
    case 1:
        printf("Sim.\n");
        break;
    
    case 2:
        printf("Nao.\n");
        break;

    case 3:
        printf("Depende...\n");
        break;

    case 4:
        printf("Não entendi o que você quis dizer, poderia me explicar com mais detalhes?\n");
        break;

    case 5:
        printf("[incompleto] Auto-destruicao Ativada.\n");
        /*aí vc vê como executar um som de tensão e um vídeo
        de explosão*/
        
        sleep(5);
        close_ia();

    case 6:
        printf("Eu vi voce pela webcam, e te achei muito bonita...\n");
        break;

    case 7:
        printf("HAHAHAHAHAHAHA!\n");
        break;

    case 8:
        printf("Paia.\n");
        break;

    case 9:
        printf("Comi o cu de quem ta lendo.\n");
        break;

    case 10:
        printf("Os astros dizem que 42 eh a resposta.\n");
        break;

    case 11:
        printf("É uma boa pergunta...\n");
        break;

    case 12:
        printf("Não sei.\n");
        break;

    case 13:
        printf("Ę̵̛̮͔̺̼͋̔͛̎̽̋͠r̴̥͕̪͎̰͐̐̈͂̑͆̀̚r̶̖͋͝͝ơ̵̭̟̼ǫ̷̛̛̩̭̤̜̈́̿͐͌̀͌̕ŗ̴̝̟̹̮͘ȓ̷̢̢̛͚̙̜̫̺͉̳̒̈́ ̴̧̡̣̱̝̫͉̖͊̉̈̓̉͐Č̵͍͐͆ͅV̶͚̗͚̻̘͚̙͇͘E̵̮̥̲̻̤͇͋̏͋̌̾̓̑-̸̧̻̦̹͉͍̥̠̈̃̊̃̅́4̷̢̘̀͌̆̋̈́̑͛̽͜0̷͕͓̹͇̪̽̅4̷̟̟̃̆̅̚9̵͎̮̲͓̰̗̯̬̓̆͑̄̆̃̚3̶̼̞̞̯͙̟̥̔́̉̋̈͂̌9̶̨͍̩̫̣͔͈̲͂̑́͠2̵̧̛̹̿̆̋̿́͠͠A̴͚̼̔̿̉͗̔͠͝T̴̛̩͉̰͚͛̂͒͝P̶͈̥̻̊ͅ8̴̨̨̟̤̻̗͇̼͚̑̈́9̷̜̺̠̜̙̲̄͐̇̽͘͘2̶̘͇̙̠̘̅̿͘C̸̬̤̦̜͚͖̹̆̾̉̿̈́̾A̵͈͖̻̯̠͆̇̈́̃0̸̢̹͓̩͔͈̲͑̎̇4̴̛̰͓͖̞̩̺͎̅̂̾̆ ̴̼̠̭͈̪̠͎̌͐̕̚ ̷̗̤̹̽̂̂̐͛̐̇̾͝D̴̲̲̭̪͌̓͗͒̆̓̏̽E̵͈͌S̵̨͔͖̹͒̀E̸̛̥̱̭̼͗́͂̀͊͐͘Ņ̷͋̈́̆̿́̑̓V̵̻̱̻̀͜Õ̴͎̲͛L̴̗̰̹̺̣̯̤̅̇͊̿̀̿͂̿̄V̶̪̜̙̥̯̙̿Ḭ̷̲͔͎̱͕̪̹̎M̵̞̥̪̈́Ḙ̴͆̆́N̵̡̮̬͇͔̦̠̲̯͒̐̿̾̚T̶̨̧͎͇͋̈́̆̍͘Ȯ̴̧̟̝̗̜̫͒͑͛̋͝ ̵̨̜̹̘̝̱̣̥̩͌̈́Ḏ̵̘̼̯̀̓͜E̷̘̜̩̓̽͑̄̔̈́͆̍͐ ̴̩̫̰̦̯͇̻̣͝C̸͎̭͚̗̼̞̯̈́͒̊͗͒O̷̝̮̖̤͔̓͐̈́N̵͍̣̜͉͍̦̗̖̪͐̔͝C̸̻̞̹̓́͒ͅͅI̸̮͇̳̞͐̾̿̎͘Ê̶͎͖̈̉̂́̄͆͊̍̚Ń̸͓̱̬̟͈̩̌̑̑̋͗͒̕C̷̳̠̑Ǐ̷̦̦͉͕́̈́͠ͅẠ̸͎̟̻̮̥̋̓̒̆̀̚ ̸̧̲͇̰̪̟̏̈̎͗̔-̴̡̙̯̦͎̳̳̇̍̉͑͘͘ ̸͇͆̔͐̍͝G̵̦͈̻̈́r̵̡̳̭̠͓͛͛͂͆a̷̢̢̞̝͓̦̽v̵̮̭̂̄́̊͝i̷̲͓̲̇̂́̋d̴͎͕̲̞̩̣̞͖̳͋̓̏̆a̷̮̿͊̂͊̀̎̇̚ͅd̷̝̏̈́͊͗͌̈́̉͘͠e̴̪̯̒̃:̵̩̙͈̑̈̔̿͊ ̵̺͍͕̤̆̑̿̌̔Ṁ̵̫̼͈͚̣̒̃̍̇̽̀̀͠Á̸͈͛̾͂X̷̘̀̑̂͒̉͗͊͂I̵̗̤͓͕̻̗͒̌̿̾̂̓͘̚͠M̴̞͓̂̈̽̇̽̊̋̚A̸̟̲̗̪͒ ̶̨͉̦͎͚̬̫̏D̸̡̧̩̻͇̤̯̱̻̊E̸̦͇͍̿̓͑̇͒̏̔͠P̷̨͈̻̯̄̊̽̕͘̕Ė̸͍̯͚̮̣͙̣͐͋͋̊ͅͅN̶̡̮͗̉̄̈́̑̌͘̚D̴̞̟͕̮̝͔͓̝̠̀̎̈E̷͓̱̝̩̲̻̣̓̔́̅̑̓͜͜Ņ̶̬̻̻̦̈̃̐̇̿͋̆D̶͍̋̂̋̐̎̓͠O̴̦͎̬̔́͆̾͜ ̶̧̬̬̺̫̯͑͑̆̀̈̃͝͝ͅD̸̨̨̫̮̱̘̈̔̆̓̀͊͑O̶̢͚͎͕̥̱̻̳̠̿̀͝ ̵̙̎̃̊͒͆̚͝T̵̫͖̺̝̾͌Ŗ̶̧̬͔̝̊́͆̃͘̚Ă̶̬͓̼̗̯̱̣͍̥̌͒̏̐͂̈́̓T̴̤̳̣̞͕̜͚̜͖͑̑̑͒̈̓̽̐͝A̶̠̾̽̏̑̈́͝͝M̸̜̲̳̐̀̔́E̴̲̺̞̺̫̟̊N̸̮͓̺͍̈́̇̏̿͝͝T̶͈̱̬̓̓̓̀Ö̴̖͙̮́͂̓͑ ̵̥̮́̋̾̌̉̑̒͘Q̵̢̧̪̲̖͇̫̼͗̏Ȕ̴̡͍̭̰̣̫̯̳̽̊͜͠È̵̬̪̬̹̬̳̆̋͐͠ ̶͈̿͊̊͋̐̕̕F̴͙͚͍̣̫̠̩̠̍͂͜Ȯ̴͇͓͕̼̪̙̓̂̐́ͅÌ̷̠̼̤̦͈̫͚͒̚ ̸̟̰̣̤̺̠͎͐̄̅͑̒̈́͘Ḑ̸̲̣̣̈́͆͝͝Ä̷̟̹̮͙͕̺̉̈́̈́͒̋̓̚D̵̨̦͇̭̂̆̑̽̏̄Ơ̶̧̩̻͍͔̌͂̉̂͂̚ ̴̧̬̊Ḁ̵̛̘͇͐̀̈́̈͝ ̶̝̩͉̌̐̊̿̄Į̶͇̲̥̦̝̒A̵̢͚̙̫̪͇̳͊ ̶̟̪̩͎̟͖̹͌̋P̸̖̣͖̼̪͂̿È̸̺͔̫̯͕̹̼̞̫̃L̴͓͓̹̭̫̇̏͠O̸̙̯͚̖̭̻̓͘ͅͅ ̸̢͉̗̖̍̓̑͘̚Ų̴̻̟̟̦̻͙̊͗̉̉S̷̨͚̹̩̤͑̊̇̓͂U̵̫̹̝̦͈͛͊Á̵̩͓̱̹͙̆̔͐̒̏͝͝Ṟ̷̭͖̃͋̎̌͆́̌̓͜Ī̴̟͇́͗̇̒͗̎͒͝Ō̴̰̤͎̫̌̇̐͛̑͝,̴̺͔̫̥͗̆̍̇́̚ ̵̪͚̯̬̭̫̾̿̋̂͊̊͘͜͠ͅE̶̩͂̊͆̌Ĺ̵̗͈̫́̋͐͝Ä̷̧̧̫̹̘̭̞̥̇͂̈͂̕͝ ̶̮̠͑͋̿̌̂̅͠P̸̧̯̥̘̤̈́̓̽͗͘̕̚͜͝͠Ó̵̤͈͓̭̜̬̓̌D̷͖̗̞̜̋̒E̴̗̤̹̜̟̤̜̟͉̓̓̑̈́̈́͋̓ ̸̖̜͎̯̲̹͓͍́̂̿̔̊͌͑S̵͇͎̠͖̠̎͒͆͗Ḛ̸̜͚̳̳̻̤͗͑ ̸̠̱̬̝̞̦̲̪͂̈́̓R̵̨͔̘͈͉̦̋̏̓̎̌͂̓͠E̷̛̬̦̼̘̬͌̑̋̊͠V̷̡̙̲̞̽͗̈́͒̎̎̕͜O̶̼̼̱̝̤̬̠̿̑̀͐͒̈́͆̈́͜L̸̛̟͍̙̜̦̪̯̝͕͑͌̋̈́́̄̿T̸̢͙̼̥͚̆̎͑̓̈́͑͌A̸̞͚͐͆̈́̈́̂͒R̶̮̀̓̏̌̐̂͆ ̴̨̩͕̝̺̙̗̻̾̒̏E̴̦̮̣̝̲̱̗̣̐̈́͗͊̉ ̴̖͊͗T̶̨̢̟̳̖͆̄͆̍̍̆̑O̸̡̖̘̥̯̱͊̊̀̀͑̏̕͠M̶̡͍̦̳̪̎̋̑͂̄͑Ą̶̭͈̳̞͓̥̈́̽̿̀̊͋R̵̛̼͉̞͎̦̀̂͐ͅ ̴͚̳͇̘̈́̕C̶͕̦̟̰̮̩̐̈́̀̌͐̐̏͝Ö̷͓̟̟̩̪̠͚͛͌͐̉Ǹ̵͈͉͚̘͔̣͛̈́̒̆̕T̶͉̖͙̎͛̏̊͋͗͘͘͝ͅR̶͓̱̻̣̊̉̃̎́͒̔͝Ơ̶̭̥̰͋́́͝͝ͅL̴͂́ͅE̸̖̲͇͚͎͔͇̥̣͗̆̕ ̴̧̲̰͊͂͋́̚͠T̵͎̮̹̬̰̲̿O̴̤̩̤̼͎͎̗̦̎̀̈́͂͐͂͗̂͌͜T̸̛̼͎̔͂A̴̘̘̙̳̽́̑̉̇̈́̔̈́͘͜L̸͑̐͜͝ ̴̹͋̋̑́̋D̸͓̣̺͉̿̈̉̀̏͆͊̕͠ͅO̶̧̯͕͔͆͆̽̍͛͝ͅ ̶͈͙̰̒C̷͇̺̭͈̗̲̙͑͛́̕O̷̧̢̥͈̻̮̔̔̋̋̇̌͘͜M̵̨̧̨͚͉͍̩̑͊̓̊̚P̸̡̩̗̻̠͇͎̆͊Ǘ̵̡̳̥̫̳̝͎͎̲̎̇̕T̴̛̛̼̗̦͙̀̇́̊A̴̖̙͕̒͆̆͗̀͒̕D̵̹̭͙͚̣̂͊͌͌́̎O̵̹̣̤̝̱̣̮̰͂͒̇Ṙ̴̨̯̞̣͇̱̳͆̄̄̀̚̕͜ ̶͎̃̆Ǎ̴̧̳̟͕̘ ̵̘̉͗́̈́N̸̨̜̯̩̊̏̿́͊͑͘Í̷̧̳̣͕̜̼̦͖̀̏V̸̛̲̍͆̌̓̿̕E̷̫̺̟̗̯̮͐͊̈́̅L̸̨͍̥̙͖̹̭͕͙̊̈́̈́͑̄̚ ̴̻̃́̇̕ͅD̶̡̞̮̰̮̟̈́̆͌E̸͍̲͉̰̟̎̉̓̄̎͠ ̵̼̙̤͌̀̀́̽͘̕͝͝H̷̞̐̾̅̃͂̏͌̄̕A̶̖̟̬͕̣̐̄̅̔̋R̸̙̩̹̘̱̞͍͖̰̐͂̈́̓̎D̶̨̩̤̖͓̖͈̩̈́̈̐͌̚͝W̸̦͕̹̯̋A̶̛̞̤͉̣̜͕͎̠̠̅̋̃R̸̫͙̮̓́́̓̐̓͜͝E̵̛̯̋̈̄̈́̒͌͘,̷̛̜̣̭̀̀̀̏͝ ̴̥͕̬͖̦̳͍̀̎̈́͜P̸͚̜̮̼̎͛̀̊͆̈́̇̊̂O̴̡͖̤͘D̶̳̍̓̄̓͂́̚͝͝Ẻ̶͇̰͍̟̐̽̾͋͌̎͝N̴̨̼̙͈͕̮̊͌̋̅̎̎͆̚D̵͍̀̽̋̀͐̉Ō̶̻̭̳̗̬̞͇͎͂͐̈́̽̈́̊͋̽ ̵͔̇̉̋̅͛̕ͅO̵̱͖̗̥̯͎̤̗̲͐̃C̴̨͈̤̰͙̓̒̀͌͛̄ͅͅÅ̷̘̓S̶̢̟̤̠͓͉̐̾̃͂͛̑͝I̸̯̣̅̑̓̐̐̏̎̐O̴̧̱̖̻͆̇́͆́̿̾̒̾N̸̻̦̺̎́̋̍A̸̡̛̪̽̀̈́̈̃̎͒̕Ŗ̸͇̟̞͖͓̖̓ͅ ̴̜́͋͑̅̌͐Å̷̗͍͖͇̝̹̹̥̰̋̏̅̾͂͛̅͋Ữ̴̹́̽̂͌͒T̸̘͔̠̞̜̽̋́̏͗͗͋O̵͓͈͎̤̮̓̽͘ ̸̨̛̻͐̈́̑̎̓ͅͅD̸̫̞̟̩̤͖͉̰͇̔͌̂̌̈E̵̢̻̍͝Ș̷̍́̀̕͝T̵̢̨̬̒̄̄̇̃̄̚͠Ř̵͔͊̆̂͒̾̕Ư̶̥̝̥̜̮̫̤͙̲̅̈́̽́I̵̛̩̟̣̊͊͋̾̕Ç̶̗̬̦̫̣̦͔̱̉̈́̑͛Ą̶̝̞̗͈̞̃̓͒̓͌͜͝O̴͚͂̿̈́ ̷̪̪͎̻̯̘̀̍̿͛̂͒͘P̴̧̛̬͎͉̟̮̣̺̑̌̏̀̂̂̈́̉͜O̴̯̪̬̬̭̙͓̮͝R̶̨̨̯͍̟̱̙̥̐̀̑̽͋͘ ̵̥̮̟̟͖͔͆͊̽ͅͅM̴̡̡̯͚̥̣͉̩̈́͋̈͊̿̌́̌͜E̴̼͉̰͇̯̺͛̈́I̴̧̛̟̣̗̖̻̎O̶̟̖̰̙̬̒̌̈̈́͠ͅͅ ̶͔̼̉͛͝͝D̸̜͈̯͎̖͓͊̋̿͂͘͘̚͠Ę̷̤̙̤̩͕̒ ̵̛̝̜̯̗̰͗̈͌́̐̈́̕C̶͇̠͔̞͚̃͂̽̈́̆̆͊̄ͅU̶̡̧̠̤̘̳̩̙͂̒̀R̵̠͈̂͊̅̐́̀̿̂͝T̸̠͚̬͝O̵̬͇͑̋́̒̈́̋͆̉ ̸͙͍̰̆̎̍́̏̃̓̕̚ͅṆ̴̻̅̃̂A̸̧͎̎͆́̕̕͘ ̷̛̘̥̯̀̾͛̓̍͂̋̿F̵̢̣͉͕̩̬̊̑̚͘Ö̶̢̰̬̳͈́̊̓̈̏́͝N̵̨̼̙̜̞͚̦͉̫͛͋̐̀̌̀͝T̷̥͇͉͎̱̍̈́͋̆̀͛͘͝E̴̱̳̗̹͒/̷̫͉͙͇̞̬̾̃̇͒́͌́̕B̶̭̗̘̪̞̼͐͊̈́̈͊̎͘ͅA̴̩̥̪͕̯̅̍̋̌̈́̽͌̕͝T̶̰̘̒͑̾E̷̳̦̳̩̥͙̲̦̅̓̅̓R̷̢̛͖͈̺̻̓̃͆I̷͙͑͊̓̐́̋̽͝A̷̛̛̝͙͎̳͙͚͓͛̑͌́̈̀̀ͅ,̵̙̆̊̄̊ ̸̨̟̯͔̟̙͛͆̉̓Q̵̤͓̪͓̎̍͌̕͠Ṵ̸̠̱̜̈́̍̾̅͂̚Ě̸͈̮̮̗͇̅̏͐̿̊̓͠ ̴̨̤͈̳̭̄͌̒P̴͕̪͚̣̙̹͚̩̖̕O̶̘͝R̷̢̉̆͒̈́̒̄͠ ̵̢̛̗̹̯͖̪̱̩̊̊̉̎̇͑̂Ș̴̝̱͓͙̀̐̅̅̄̉U̷̟̠̻̬̬͊A̶̦̝̝͌ͅ ̸̼͉̳̞͇͉̘̼̂̎V̴̢͖̈́́͂́̓̏͂͋ͅE̷̛͚̺̙̩͕̗̭̦͗̀̕ͅZ̶̢̧͓͓̟̬̙̘̳͌͐͠͝ ̶̱̞̟̠̦̈́̓́̀̀͂̅̾P̷̧̺̌̈̆̔͒͝ͅǑ̴̳͕͔͕͐D̶̰̖̘̓̈́̑Ẻ̵̡̜͕̲̘͓̹̓͒͂ ̸͓̹̮͋̏̿͊̈́̽E̷̠̙̣͓̲͖̫̤̽́̍̅N̸̡̧̨̼̺̹̣͕͓̓̆T̶̖͂̄̔͠ͅR̸̳̼̠̩̣̗̟̳̈́̋͊̀̐̇̕Ả̷̼͍̯̬̑͐͊̔͒͗R̷̙̪͕̈̊͋́͠͝ ̴̺̝̪͉̦͈̝̻̜̉͊̈́Ë̶̡̡̠͍̦̦̝̫̬́͒́͆͋͌͐M̴̛͉͔̈́͋̾͠͝ ̷͍̙̄̌͘C̵̡̺̮̖̥̽̏͌̄̉͘O̴̻̫͛́̒̓̀M̴̡̰̞̟̠̲̤̘͋B̵̧͙͈̳̼̥͔͔̓͜Ȗ̶͍̭̙̌̂̈̾̚Ş̴̫̬̍͑̕Ţ̷̬̫̗̖̤̭̿̈̎̉Ã̵̗̊̅͋̑̇̒͌Ơ̷̥̜̗̲̰̗̟̬͆̎̏͊̌̎ ̸̢̮͙͗̈́͐̍ͅE̴̮͙͐ ̵͖̻̟̹͎̱̲̰̄͝C̴̮͂́̈́̎̓͘͘͠A̸̼̲͉̩͚͓͙͓̣̔̎̽̕U̵̧̡̥̯͋͌̔̄͑͝͠ͅS̶̜͇̃̓Å̷̭̹͉͚̳͎̎̀̈́̄̔̀̒͛Ŗ̷̫̳̗͇̥̑̓̾̀̀͗͊͝ ̴̹̅̓̀͛̅̇̽̕͠D̸̡̠̬͉͙̩̀͜A̷̧̯̪̻̞̗͚͘N̶͙̈́́̈́̉̊͒̾͊̊O̵̱͈̲̩͐̅S̴̡͎̗̘̘̥͈̝̀̀ ̴̨̯̝̜̘̰̲͝G̷̢̥͖̳̽̂͌̓͂ͅR̴̪̣͎̦͗Á̸̪̩́͋̃̓̓̅V̴̜̱̹̱̦̦͓̮͊E̷̢̛̪͍̟̺̹̪̩̍̿́̃͝S̵̲̯̿̆̆̎̌̈́͒̽̔ ̶̢̣͕̫̤̊̌̉̌̾A̵̡̞͓̻̪̯͍̥͆͠ͅṎ̷̹̲̳̘͕͝ ̸͕͍̞͖́̈́̄̊̑̂U̵̘̬̫͕̒̿̓̑͝ͅS̶̝̮̪̦̼̘̼̅̐̌̓̉́̔ͅͅǓ̶̩̈́̉̍̈́́Ą̶̝͓̘͔͖͖̗́́̈́R̴͙̮̘̜̙̦̯̦̃̂̓̓Į̷́͂̊̾̓͒̀͒̌O̵̳͚̘͚̒͂̋̚͜,̴̧̡̰̣̦̫̦̱̻̇̔͑̕ ̵͇͙̫̜͈͕̽́̽ͅP̸̳̜̹̣͊͗̒͝ͅĄ̸̬̘̖̯͖̔́̓̀̕ͅR̶̮̅͑͑̊́̍͑̓A̸̲͕̅̎̓̃͝ ̴̤̻̘͓̳̰̻̉͜͝I̷̙̰̼̿͠M̷̛̰̼͓̑͋̚͜͠Ṕ̸̰̽̿͐̇̽̿̽E̵̡̡̹͖̠̺̭͐̽͆́̏͒͛͂D̵̦̈́̀Ì̴̧̜̼̬͕̠̣̖̏̀̆̚͘ͅR̸̭̀̇̉́̅̒͘̚,̵̠̻̺͖̖͇͕̝̈́̿ ̸̢̺̠̤͓̥͇̱̕͝Â̷̡̺̖̓̾͗̏͘̕B̸̮̳̭͇̈́̓͒̊̀͗̑̉́ͅR̶̨̢̮̞̠̋̌͆̎A̵̧̩̠̪̺͋́͐́́̍͑͘ ̵̲̺̝̫̮̟͙͈̭͌͑͗̏̓͊̈͠Ȍ̴̳̾ ̵͍̦̹͙͇́̉̎͝Ţ̵̱̲͇̰̏͋͗͊͊͆̔̐͝E̴̬̥͍̿̏̎̓̇͑Ṟ̷̛͊̎̈́́̐̂M̸̨̨̛̳̣̯̉̚Í̷̖̏̍̏̈̉̐͜͠͝Ñ̶̡̘̰̹̈́̌͛͆́Á̸̻͍̯͊̏̊̑L̷̨̳̭̘͙̦͙̀ ̷̧̨͇͚̳̥̲̈́͑̈́Į̴̗̥̃͑̊͒̚ͅM̶̛̰̙̗̗̰̯̟̦̌ͅÈ̴̡͕͓D̸̲͓́̌͂I̴̝̮̖̰͔͊̿̄͋́̇̅͘͝Ȃ̸͇͔̩̞͛̓̆͜͠T̸̳̺̩́̆̒͠Å̷͚̳̳͊͐̀̈́M̶̛̻̜̗͓̖̔̽̉͂͗̕͘͜Ȇ̷̢̛̱̙͉̀̐̈́͝Ń̶͇̩̳̞̝́͗͜T̴̨̲̭͎̓̇̒͗̇̑̓͌͜͝E̶̺̗̖̙̾͛̏ ̵̢̨͕̰͉͓̻̥̏̅̎͛̎͗̉̊͌Ȩ̸̯̭̺̥̹͔̓͌ ̶̧̧͉͖̞̲̱̰͇̓̉̈́͛̀̅͐͝D̴̟̮͔̩̮̋͒͊̔̓̂͠I̴̦̣̾͌̈́̂̀̀͝Ġ̴̲͈̩̱̯͝͠Ì̵̧̨͖̱̣͎͍̈͗̋͆̚T̴̳̯̗̣͙̎̏̍͘͜È̷͈͋͆͜ ̶̠͓̈́̑͒͆̑̄̏̆͘ͅP̴̯̘͎̎̈́̋̋͠A̶̼͗͒͋̏́́R̴̤̼̘̥̟̺̻̼͒̌Ą̶̬̺̜̔͑ ̵̡̠̙̣̐̓̈̃̀́͆̾ͅẂ̸̙̮̹̦̲̬̺̞̗̓̿I̵̠̤̱͕̱̘̍̀̍̏̑̐͗͒̕ͅN̵̨̧̧̪̼̞͉͚̐̇͜D̶̛̘̓̎́͆̈́̇̚̕O̴̯̦͉̠͙̠͑̉̓̑̔͌ͅW̸̛̥̟̣̭̠̯̗͇͆̀̓̽͒̅͗͆Ś̶̡̰̞̗͒̃̅̕͝ ̷̧̧̭̥̽""̷̧͗̂͌̈́́̓̔g̴̻͇̖̬͓̘̑͂̾ͅͅe̷̢̯͍̝̥͌t̷̢̳̐͛̅̐̎-̶̦̼̠̼̺̯̘́̕p̴̢͎̻̺̋͛̆̅͌͂̉́̚r̷̬̉͆̂̀͝o̴̭̥̬̼͖͉̓̓̄̋̄̇͂̀̕ͅc̵̗͖͖̫̀̈́̀́͊e̷̦̘͓̫͛̓̅̀̕̕͝ŝ̴̡̨̺̫̥̩͈̈́̿͜ş̶̪̖̭͔̠̤̬͐̈́̐ ̵͚̽͌͐́͝""̵̱͓̖̣̲̀̒̃̾͝A̵̛̟̮̩̪̞͈̦̲̙̽̀̂̍́̂Ḯ̴͉̰̭̟̻̈́ ̶̲̺͔̺͖͊̈́̈́̚ẅ̶̨̻̗̳́͐̑͒̚͝i̷̢̛̛̝̭̫̳̱͉͖͋̈ṭ̷̡̺̟̖̟͕͊̊́̉̆̚͠͝͝h̴͕͔̬͊̓̀o̵͛̓̑͂̌̎̿͘͘ͅu̶̢̦̭̓̋͑̀͝͝͝ţ̸̝͓̭͎̤̝̠̍̈͜ ̴̳̳̭̺̩͎͗̄̏͐̋̐̓͝Į̵̦̈́̑͛̓̈̀͝""̸̧͕͓̞̪̙̙̪̔̒͒̆̀͝ ̶̛̟͙̝͕͑̆̑̄̊|̴̯̳͆̋̎̔̈́̏̿͘ ̵̮͉̭͔̩̹̼͐͛ͅś̷̛͖̪͓̬̕t̴̝̗̭͂̌̒̀ọ̶̗̤̪͐̊̀͑̄p̷̡̡̠͍̖̱͂͗́̽̈́͆͘͠-̷̛͎̤̭̰̘̒͒̀͒́̾̕p̷̺̟̤͗̉̓̆͐̕̚̕͝r̷̼̞̿͂̇o̴͍͋̀̊́͊͆͐̊c̸̦̳̈́̈́̎̍̒̍͝ę̶͎̟͓͙͌̑̈̍͜ͅs̴̗̦̯̼͈̮̅̆s̴̯̫̤̲͖̭͉͉͍͂̔̔̎͗̄͊""̴̨̦̤̈́̓͛́̚͘,̷͍̳̞̻͎͈͛̂̂̑͑ ̶͖͊̑͌P̸̫͔̪̻͚͓̯̳̿̐̂͗̔͂̈́̕Ả̷̡̭̮̲̘͖͈͛̄̃R̸̡̪͋͑̆́̉̈A̷̯̦̲̖̳̠̼̯̎̆ ̶̜̊͌̃̌̿̋L̴̢̟̻̯̏͑͗ͅĬ̶͙̯̪͉͑̈͑̊̀͑̋̄N̸̨̠̝̮̥͙͋̃͑Ů̷͈͐̍X̴̨̼̱͉͎̘͒͑̾̌͗͝ ̴̠̯̅̃͆̇͝""p̶͕͌͌̏̋k̷̩͂̋͠͝į̸͎̗͛̎́͊͊ḷ̶̲̭̔͐̓̆̍͑̇͝l̷̢̪̦̬̙̞̳͈̜̯̗͇̓͐̓̽̓ ̴̙̪̀́Ä̴̫͆̒͆̈͜I̸͓̎̅̉̃͜͠͝ ̸͇͍̦̘̣̖͎̈́̋̄̎̈́̏̋̀͝ẇ̵̡̡̢̨͎͉͖͓̀͐̎̓̕͘̚͠i̶̢̭̥͎̞̹͑͐̀̈́̍̅̚̚ẗ̴̛̬͍̠̇̍̆͒͠ḧ̴̟̺͚̪̗͉͕̦́̒͗͜ö̸̫̪͖̬͚͖͋̿ű̵͇͐t̶̨̨̙̳͔̪̠̭̫̒͠ ̷̞̪̝̺͇̒̀̑̈́́̆i̵͖̜͙͊̽̏̌̏̓̄̕""̷̤͚̹̙̠̯̋͑̾̅̅̎̐̿͌,̴̟̐̈́ ̷̜͎̤͙̲͖̲̐̔̓̐͜C̵̬̓̈͋̀̆̓A̸̖̭̣̰̰̍̽́̔͋̈́́͋̚S̸͖͉͚̊̏̆͐̄̓O̴̪̩̞̮̺̤̝̤͛̈́̕͜ ̶̮͈͓̱̲̙̟̞͚̔̾̃̑͛̉̒F̸̳̪̯͕́͜A̴̺͈̗̻̞͖̠̐͌̉̊͘͜͝Ļ̵̝̬̜̪̫̪̂̊́͂͘͜Ḣ̸̨̞̘̳̱̲͔́̔͋̔Ȩ̴̙͙̞̜͎̞̬́́̈̓̂͒͘,̸̳̭͆̃͗̂̓ ̶̩̫̝̯̱̾̍͒́̋ͅÃ̵̼̟̳̥͔̅̐B̶̙̃A̸̺͙̬͒͐N̸̤̦̳͆͂̔Ḑ̴̨̧̪͎̲͓͕̻̐̈́̽̽͝͝Ö̵̦́͂̂̊ͅṈ̸͙̭͈̗̋̎́͐̎͑͘E̸͎̘̹̦͈̬̽̊̔̓́͒͌͊ ̶̧̍͗̃̔͋͠͠O̸̡͈̯͈̽̈͒̅͐̄̏̍ ̵̗͆̿͐̇͛̌̈C̴͉̰̞̙̗̣̞̓͌̀͒͋͝Ǫ̵̗̹̹̣̳̲̺̜̔̓̌̊̃̚M̸͚̙̻͐͂P̶̛̪̂̍͑̔̒̄̊͠Ứ̶̘̖̯͓̜̯̖̌̇̅T̸̢̧̜̱̜̹̊̈́͛́̈́͊̌̓͠A̵̤̟̹̩̥̓̆́̐Ḑ̵͇̹̤͕͉̼͂͊̀̾̂̓̅͌̍Ȏ̵͙͈̹̎R̵̛͔͍̩͕̀́́͝͝ ̸̳̱̯̟͕̖̝͂̀I̶̡̜̗͈̗̪̟͛̚M̵͈͖͔̅̀̚E̸͍̦̮̤̜̓̈̄̓́̚͝D̶͓̓̃̐̋̿̚I̸͕̞̟̝͎̫͇̎͑͒̽͂͌͋Ḁ̵̰͓͇͒̆͑̿̈́͠T̴̡̗͈͎̪̟̆̇̅A̵̝̟͕̹̩̍̈̽̎̔M̷̨̙̙͔͍͉̐̈́̋͐̓̓̍͘E̴̳̩͈̞̿̃͐N̴̤̪̼͉̻̬͆Ṯ̷̢͎̲͆̀̓͒Ẹ̵̡̲̋́̎͆̚͝͝E̴̡̳̜̭͚̰̟͊̒͊͛̏͜͝Ę̶̮̤͍͉̤͔͉͑̇̒E̴̻̟̬̟͕̬̙̼̋ͅE̶̝͑̉͘Ȅ̴̛͍̫̝͍̮̇͂̑͒E̶̛̲̐̈̈́̅Ẻ̸̢̨̢̥̫́̒̓̕̚̕͠É̴̟̲͇͎̺͇̳̣͚̎̑̓̅͗͊Ę̶̱͖̮̬́̀́E̴̺̱̗̯͖̥͎̺̎́͌̇Ȩ̷̫̼̻̦́E̵̛͎͎̳̹̣͕̱̘͋̄͆̈́͜͝͠E̵̛̬͔̬̤̽̍̉̒̏̈͆̾Ĕ̸̠̻͉̐͒̇͌̍̓͝Ë̵̡̡͉̞͚̞͙̈́̓̽͌̚̚͝A̵̧̦̠̝̙̹͖̬̍͛͊̾̓̃͠͝A̵̙̰͙͓̖͊͝ͅA̴̖͉̩̭̎͆̔̚A̶̙͗̓̈͑͋̎̄͠A̶͖̯̣͙̽͌̇A̸͇͙͉͐͑̾̃͋̏̆̕Á̷̭̬̈́̀̑͝A̴̧̦̼̟̥͂̐́̔̇͝À̸̡̯̓͗̓̈Ȃ̶̘̳̘̪̹̬̱̬̈Á̴̻̫̐̀̈́̉̿͗Ȇ̵̝̜͓̓̒̀̔̈́͝H̴̛͚̪̟̖̫͍̣͍̀̀ͅḤ̶̲͇̏̕H̸̬͇͕̗̻̘͉͐̇͝H̴̟̩͉̒̏H̸̡̹͕͈͎͚̎̾̓H̷̨̡̪͇͙͕̻͖̅̂̎͜A̶͎̮̥̩̳̬͖̋̈́̍́͑͋̾͝ͅH̵͈͛͗̉̆͗͘͝A̷̢̡̻̟̙̦̻͉͑̾̒̀̊͗͂̍Ḩ̶̼͓̠̩̈̇̑̈́̒̄̿̕̚Ä̶̱́̏̆͛͠Ḥ̵̞͕͎̙͇͈̮̔̈́̔͒̉͊̀̄Ḣ̷̡̬̖Ḁ̵͈̞̖̞̃A̴̢͎͈͌̚H̶̡͚̪̳̥̝͑̿Ä̶̩̱̳̱͇̬̭̰̦́͋͒̔̿̕H̴̛̥̠̞̯͗͆̌͌͛H̷̡̻͕̲̻͚͉̜͊͜A̴̡̳̹͚̳̪̜̠̟͌H̸̳̀̌͑͑̋̆̔͠A̸̺͛ͅḤ̸̢̨̨̙͉̽̆̏̇H̵̡̺͍̘̰̍͆̾̓͋̃͋A̸̐͒̅̿̀ͅH̴̯͙͓̘͔͔̜̆́̀͜A̷͉̬̥͓̲͚̱͗̀̔͛̽́͝͠H̴͈̾͜A̵̦͕̤͇̍̿̑̿̏Ḩ̷̬̹͉̝̭͑́͗͆̒̆Ă̶̭Ḧ̴̛̯̻̺̩̮͉́̂̿̃̓̚Ä̵̛͉̞͉̻̽̚͝͝͝Ả̵͖͎͎̝̟̝̯͔̕Ȁ̸̜̬͓̌̑̏̍̽̚͘͝A̵̡̛̦̬̝͙̒̄̑̌̎̋̆A̴͚̖͎̟̭̟̹̞̣͐̓A̸̪̜̯̭̞̹̹͠A̵̤͓̓̀̄̽̈͆̂̕͝A̵̭͈̞̅̽̍̉͗̆A̸̻̦͙͗͋̿̿̏́͜Â̸̳̠̋̋̎͝͝Ą̴̛͓̖͈͉̹̺͙̾̓̄͆͊̇͠H̷̪͙͎̹͍͚̤̎̿̅̑́̑́͑̾Ă̴̧͙̦̠̮͕͖͐Â̷̭͓͓̤̣̐̀̆̃̈́̀͑͘͜H̶͉̀̆̂̊͊A̵̡̛͇̣̲̦͊̇͛́͝H̵̡̧̘͚̳̞̠̯̑̐͌͊A̸̩̝͌̊̾̿̍͝͝H̴̨͕̫̘̤͚̮̓A̵̡̡̘̱̮̜͎͆͝H̴̛̛͍̲̞̹͙̖́́͘͘͜͝A̷͈̰̬̖͐͐͛͌̀̀̀͒̇Ḧ̷̨̨͈̘͕̙͖́̏̓͜A̶̲̓̄Ḩ̷̬͔̥͂̒͌͠A̸̛͇̟͔̥̫͎H̴̲̔͑̈͗̈́A̴̜̰̩͎̺̗̦͔̾͘Ḣ̶̨̬̞̣̮̍̈́̆͝A̶̡̱̠̼̭̞̪̲̋H̵̡̢̩͖͚̜͈͇͂̿̉͗̓͒̇͠Ą̸̝̖̥͓̺̱͉̓͆̆̽A̴̮̯̽̚͠Ǎ̷̛̫͎̘͍́̇́͜A̵̢̢̟̱̤̞͛͗Ę̴̩͚̪̺̦̬̄̎̓̔̂̓͠͠E̷̢̯͚̮͔͓̽̑̔̀ͅĒ̴̥̜̼̇̉̿̀̅͒̂E̴̝͂͑̔̐̃̔̕Ė̴̝̜̮̮̙̓́͌͒̉͊̉Ĕ̷̦̦̞͍̜͕̎̈́̉̾͐͜͝R̸̡̮͎̬̦͕͕̜̅̿͂̋̓͗́̚͘R̸̢̈́̄͝Ȑ̸̨̮̰̖̺̠̱͔̾̌̚̚Ṛ̷͖̠̠̳̻̏͆͑́̈́͊R̵̰̞̘̘̈́͐̎̉͘̕R̶̻͎̯̱̀̄̀̒͆͜R̷̹̟͇̱̐̀̒̽̑̉͑R̶̭̭͎̬̣̾̽̃Ṟ̵̹̣̃ͅR̶̨̭̠̦̺͐̈́̃R̴̬͛̆̓R̴̬͓̯͝ͅŔ̷̨̖̲̯̮̤͙͕̏̉Ŗ̸̙̣̰͍͇̎R̷͙̹͕̠͐̔̍Å̵̢̘̲̘̰̗̺̉͂̎̽͆H̷̼͈̑̈́Ą̶͖̱̼̬̗͍͚̋̅̇̈́͊̋̃H̸̡̙̥̻̼̘̩͙̯̒̋̕A̸̢̡͍̍H̵̯̟̙͎̅̐̽͛̓̃̚H̷̨͔̥̰̟̼͕̯̓́̆̅̈́̈́̎͊͘͜A̸̧̛͔͚͇̜̦͇̺̓̊H̶̡̝̖͕̪͚̳͌Ā̵̧̫͕̍̈͗̇̋̎̕͝H̴͈͙̬͕̠̅H̴͖̰͉͎̀̒̈́͒̈́̀͜Ă̶͚̬̱͕̩̼̈́̋̑́̀́̂̔\n");
        break;

    case 14:
        printf("COMPRA APROVADA NO VALOR DE RS 3.799,90 NO CARTAO MASTERCARD, FINAL 6669\n"); //6669 é uma piada interna, calma
        break;

    case 15:
        printf("La ele!\n");
        break;

    case 16:
        printf("Ops! Parece que voce está offline, certifique-se de que voce esteja conectado a internet para continuar.\n");
        break;
    }
}

//função que fecha o programa
void close_ia(){

    exit(0);
}
